stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_rcc.h
/**
  ******************************************************************************
  * @file    stm32wb0x_ll_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WB0x_LL_RCC_H
#define STM32WB0x_LL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x.h"

/** @addtogroup STM32WB0x_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup RCC_LL RCC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Variables RCC Private Variables
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Private_Macros RCC Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Exported_Types RCC Exported Types
  * @{
  */

/** @defgroup LL_ES_CLOCK_FREQ Clocks Frequency Structure
  * @{
 */

/**
  * @brief  RCC Clocks Frequency Structure
  */
typedef struct
{
  uint32_t SYSCLK_Frequency;         /*!< SYSCLK clock frequency */
} LL_RCC_ClocksTypeDef;

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_LL_EC_OSC_VALUES Oscillator Values adaptation
  * @brief    Defines used to adapt values of different oscillators
  * @note     These values could be modified in the user environment according to
  *           HW set-up.
  * @{
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE    32000000U  /*!< Value of the HSE oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSI_VALUE)
#define HSI_VALUE    64000000U  /*!< Value of the HSI oscillator in Hz */
#endif /* HSI_VALUE */

#if !defined  (RC64MPLL_VALUE)
#define RC64MPLL_VALUE    64000000U  /*!< Value of the RC 64 MHz PLL clock in Hz */
#endif /* HSI_VALUE */

#if !defined  (LSE_VALUE)
#define LSE_VALUE    32768U     /*!< Value of the LSE oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSI_VALUE)
#define LSI_VALUE    32000U     /*!< Value of the LSI oscillator in Hz */
#endif /* LSI_VALUE */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_GET_CLEAR_FLAG Ready Interrupt Flags Defines
  * @brief    Flags defines which can be used with LL_RCC_ReadReg LL_RCC_WriteReg function
  * @{
  */
#define LL_RCC_CIFR_LSIRDYF               RCC_CIFR_LSIRDYF     /*!< LSI Ready Interrupt Flag/Clear */
#define LL_RCC_CIFR_LSERDYF               RCC_CIFR_LSERDYF     /*!< LSE Ready Interrupt Flag/Clear */
#define LL_RCC_CIFR_HSIRDYF               RCC_CIFR_HSIRDYF     /*!< HSI Ready Interrupt Flag/Clear */
#define LL_RCC_CIFR_HSERDYF               RCC_CIFR_HSERDYF     /*!< HSE Ready Interrupt Flag/Clear */
#define LL_RCC_CIFR_PLLRDYF               RCC_CIFR_HSIPLLRDYF  /*!< PLL Ready Interrupt Flag/Clear */
#define LL_RCC_CIFR_PLLUNLOCKDETF         RCC_CIFR_HSIPLLUNLOCKDETF  /*!< PLL Unlock Interrupt Flag/Clear        */
#define LL_RCC_CIFR_RTCRSTRELF            RCC_CIFR_RTCRSTF  /*!< RTC Reset Release Interrupt Flag/Clear */
#define LL_RCC_CIFR_WDGRSTRELF            RCC_CIFR_WDGRSTF  /*!< WDG Reset Release Interrupt Flag/Clear */
#if defined(RCC_CIFR_LPURSTF)
#define LL_RCC_CIFR_LPURSTRELF            RCC_CIFR_LPURSTF  /*!< LPUART Reset Release Interrupt Flag/Clear */
#endif

/**
  * @}
  */

/** @defgroup RCC_LL_EC_GET_FLAG Reset Flags Defines
  * @brief    Flags defines which can be used with LL_RCC_ReadReg function
  * @{
  */
#define LL_RCC_CSR_LOCKUPRSTF              RCC_CSR_LOCKUPRSTF   /*!< CPU lockup reset flag */
#define LL_RCC_CSR_WDGRSTF                 RCC_CSR_WDGRSTF      /*!< Watchdog reset flag */
#define LL_RCC_CSR_SFTRSTF                 RCC_CSR_SFTRSTF      /*!< Software reset flag */
#define LL_RCC_CSR_PORRSTF                 RCC_CSR_PORRSTF      /*!< Power-On or BOR reset flag */
#define LL_RCC_CSR_PADRSTF                 RCC_CSR_PADRSTF      /*!< NRSTn pad reset flag */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_IT IT Enable Defines
  * @brief    IT defines which can be used with LL_RCC_ReadReg and  LL_RCC_WriteReg functions
  * @{
  */
#define LL_RCC_CIER_PLLRDYIE               RCC_CIER_HSIPLLRDYIE   /*!< PLL ready interrupt enable */
#define LL_RCC_CIER_HSERDYIE               RCC_CIER_HSERDYIE      /*!< HSE ready interrupt enable */
#define LL_RCC_CIER_HSIRDYIE               RCC_CIER_HSIRDYIE      /*!< HSI ready interrupt enable */
#define LL_RCC_CIER_LSERDYIE               RCC_CIER_LSERDYIE      /*!< LSE ready interrupt enable */
#define LL_RCC_CIER_LSIRDYIE               RCC_CIER_LSIRDYIE      /*!< LSI ready interrupt enable */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSEDRIVE  LSE oscillator drive capability
  * @{
  */
#define LL_RCC_LSEDRIVE_LOW                0x00000000U             /*!< Xtal mode lower driving capability */
#define LL_RCC_LSEDRIVE_MEDIUMLOW          RCC_CSSWCR_LSEDRV_0     /*!< Xtal mode medium low driving capability */
#define LL_RCC_LSEDRIVE_MEDIUMHIGH         RCC_CSSWCR_LSEDRV_1     /*!< Xtal mode medium high driving capability */
#define LL_RCC_LSEDRIVE_HIGH               RCC_CSSWCR_LSEDRV       /*!< Xtal mode higher driving capability */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_HSE_CURRENT_CONTROL  HSE current control max limits
  * @{
  */
#define LL_RCC_HSE_CURRENTMAX_0            0x000000000U                                  /*!< HSE current control max limit = 0.18 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_1            RCC_RFSWHSECR_GMC_0                           /*!< HSE current control max limit = 0.57 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_2            RCC_RFSWHSECR_GMC_1                           /*!< HSE current control max limit = 0.78 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_3            (RCC_RFSWHSECR_GMC_1| RCC_RFSWHSECR_GMC_0)    /*!< HSE current control max limit = 1.13 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_4            RCC_RFSWHSECR_GMC_2                           /*!< HSE current control max limit = 0.61 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_5            (RCC_RFSWHSECR_GMC_2|RCC_RFSWHSECR_GMC_0)     /*!< HSE current control max limit = 1.65 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_6            (RCC_RFSWHSECR_GMC_2|RCC_RFSWHSECR_GMC_1)     /*!< HSE current control max limit = 2.12 mA/V*/
#define LL_RCC_HSE_CURRENTMAX_7            RCC_RFSWHSECR_GMC                             /*!< HSE current control max limit = 2.84 mA/V*/
/**
  * @}
  */

#if defined(RCC_RFSWHSECR_SATRG)
/** @defgroup RCC_LL_EC_HSE_SENSE_AMPLIFIER  HSE sense amplifier threshold
  * @{
  */
#define LL_RCC_HSEAMPTHRESHOLD_1_2         (0x000000000U)                          /*!< HSE sense amplifier bias current factor = 1/2*/
#define LL_RCC_HSEAMPTHRESHOLD_3_4         RCC_RFSWHSECR_SATRG                     /*!< HSE sense amplifier bias current factor = 3/4*/
/**
  * @}
  */
#endif

/** @defgroup RCC_LL_EC_LOCKDET_NSTOP  LOCKDET_NSTOP time selection
  * @{
  */
#define LL_RCC_LOCKDET_NSTOP_0  0x00000000U
#define LL_RCC_LOCKDET_NSTOP_1  RCC_LOCKDET_NSTOP_0
#define LL_RCC_LOCKDET_NSTOP_2  RCC_LOCKDET_NSTOP_1
#define LL_RCC_LOCKDET_NSTOP_3  RCC_LOCKDET_NSTOP_1 | RCC_LOCKDET_NSTOP_0
#define LL_RCC_LOCKDET_NSTOP_4  RCC_LOCKDET_NSTOP_2
#define LL_RCC_LOCKDET_NSTOP_5  RCC_LOCKDET_NSTOP_2 | RCC_LOCKDET_NSTOP_0
#define LL_RCC_LOCKDET_NSTOP_6  RCC_LOCKDET_NSTOP_2 | RCC_LOCKDET_NSTOP_1
#define LL_RCC_LOCKDET_NSTOP_7  RCC_LOCKDET_NSTOP_2 | RCC_LOCKDET_NSTOP_1 | RCC_LOCKDET_NSTOP_0
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSCO_CLKSOURCE  LSCO Source Selection
  * @{
  */
#define LL_RCC_LSCO_CLKSOURCE_LSE             RCC_CFGR_CLKSLOWSEL_0  /*!< LSE selection for low speed clock  */
#define LL_RCC_LSCO_CLKSOURCE_LSI             RCC_CFGR_CLKSLOWSEL_1  /*!< Enable the LSI selection for low speed clock  */
#define LL_RCC_LSCO_CLKSOURCE_HSI64M_DIV2048  RCC_CFGR_CLKSLOWSEL    /*!< HSI_64M divided by 2048 selection for low speed clock  */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSCO_CLKSOURCE_ENABLE  Enable LSCO Clock Source
  * @{
  */
#define LL_RCC_LSCO_LSI          RCC_CR_LSION       /*!< Enable LSI selection for low speed clock  */
#define LL_RCC_LSCO_LSE          RCC_CR_LSEON       /*!< Enable LSE selection for low speed clock  */
#define LL_RCC_LSCO_LSEBYP       RCC_CR_LSEBYP      /*!< Enable LSE clock bypass selection for low speed clock  */
/**
  * @}
  */

/** @defgroup RCC_LL_HSEPLLBUFON Enable the External high speed clock buffer for PLL
  * @{
  */
#define LL_RCC_HSEPLLBUF_OFF     0x00000000U         /*!< Disable the External high speed clock buffer for PLL */
#define LL_RCC_HSEPLLBUF_ON      RCC_CR_HSEPLLBUFON  /*!< Enable the External high speed clock buffer for PLL. Always enabled when the radio is used  */
/**
  * @}
  */


/** @defgroup RCC_LL_EC_SYS_CLKSOURCE  Enable HS clock Source
  * @{
  */
#define LL_RCC_SYS_HSI           0x00000000U      /*!< Enable HSI system clock */
#define LL_RCC_SYS_HSE           RCC_CR_HSEON     /*!< Enable HSE system clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RF_CLKSOURCE  RF system clock
  * @{
  */
#if defined(RCC_APB2ENR_CLKBLEDIV_0)
#define LL_RCC_RF_CLK_32M       RCC_APB2ENR_CLKBLEDIV_0   /*!< Radio system clock 32 MHz*/
#else
#define LL_RCC_RF_CLK_32M       0x00000000U               /*!< Radio system clock 32 MHz*/
#endif
#if defined(RCC_APB2ENR_CLKBLEDIV_1)
#define LL_RCC_RF_CLK_16M       RCC_APB2ENR_CLKBLEDIV_1   /*!< Radio system clock 16 MHz*/
#else
#define LL_RCC_RF_CLK_16M       RCC_APB2ENR_CLKBLEDIV     /*!< Radio system clock 16 MHz*/
#endif
/**
  * @}
  */

/** @defgroup RCC_DIRECT_HSE_Clock_Divider DIRECT HSE Clock Divider
  * @{
  */
#define LL_RCC_DIRECT_HSE_DIV_1             RCC_CFGR_CLKSYSDIV_0                             /*!< DIRECT HSE division factor = 1   */
#define LL_RCC_DIRECT_HSE_DIV_2             RCC_CFGR_CLKSYSDIV_1                             /*!< DIRECT HSE division factor = 2   */
#define LL_RCC_DIRECT_HSE_DIV_4             (RCC_CFGR_CLKSYSDIV_1 | RCC_CFGR_CLKSYSDIV_0)    /*!< DIRECT HSE division factor = 4   */
#define LL_RCC_DIRECT_HSE_DIV_8             RCC_CFGR_CLKSYSDIV_2                             /*!< DIRECT HSE division factor = 8   */
#define LL_RCC_DIRECT_HSE_DIV_16            (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_0)    /*!< DIRECT HSE division factor = 16  */
#define LL_RCC_DIRECT_HSE_DIV_32            (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_1)    /*!< DIRECT HSE division factor = 32  */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_DIV  RC64MPLL divider factor to have the System clock
  * @{
  */
#define LL_RCC_RC64MPLL_DIV_1                0x00000000U                                     /*!< RC64MPLL not divided as SYSCLK   */
#define LL_RCC_RC64MPLL_DIV_2                RCC_CFGR_CLKSYSDIV_0                            /*!< RC64MPLL divided by 2 as SYSCLK  */
#define LL_RCC_RC64MPLL_DIV_4                RCC_CFGR_CLKSYSDIV_1                            /*!< RC64MPLL divided by 4 as SYSCLK  */
#define LL_RCC_RC64MPLL_DIV_8                (RCC_CFGR_CLKSYSDIV_1 | RCC_CFGR_CLKSYSDIV_0)   /*!< RC64MPLL divided by 8 as SYSCLK  */
#define LL_RCC_RC64MPLL_DIV_16               RCC_CFGR_CLKSYSDIV_2                            /*!< RC64MPLL divided by 16 as SYSCLK */
#define LL_RCC_RC64MPLL_DIV_32               (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_0)   /*!< RC64MPLL divided by 32 as SYSCLK */
#define LL_RCC_RC64MPLL_DIV_64               (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_1)   /*!< RC64MPLL divided by 64 as SYSCLK */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_SWITCH_DIV  RC64MPLL divider factor to switch the System clock with MR_BLE enabled
  * @{
  */
#define LL_RCC_RC64MPLL_SWITCH_DIV_1                0x00000000U                              /*!< RC64MPLL not divided as SYSCLK   */
#define LL_RCC_RC64MPLL_SWITCH_DIV_2                RCC_CSCMDR_CLKSYSDIV_REQ_0               /*!< RC64MPLL divided by 2 as SYSCLK  */
#define LL_RCC_RC64MPLL_SWITCH_DIV_4                RCC_CSCMDR_CLKSYSDIV_REQ_1               /*!< RC64MPLL divided by 4 as SYSCLK  */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_SWITCH_STATUS  Status of the RC64MPLL clock switch  with MR_BLE enabled
  * @{
  */
#define LL_RCC_RC64MPLL_SWITCH_STATUS_IDLE          0x00000000U                              /*!< RC64MPLL Clock Switch Status IDLE    */
#define LL_RCC_RC64MPLL_SWITCH_STATUS_ONGOING       RCC_CSCMDR_STATUS_0                      /*!< RC64MPLL Clock Switch Status ONGOING */
#define LL_RCC_RC64MPLL_SWITCH_STATUS_DONE          RCC_CSCMDR_STATUS_1                      /*!< RC64MPLL Clock Switch Status DONE    */
/**
  * @}
  */

