stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_rcc.h
/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Enable RC64MPLL
  * @rmtoll CR           HSIPLLON         LL_RCC_RC64MPLL_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RC64MPLL_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSIPLLON);
}

/**
  * @brief  Disable RC64MPLL
  * @note Cannot be disabled if the RC64MPLL clock is used as the system clock
  * @rmtoll CR           HSIPLLON         LL_RCC_RC64MPLL_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RC64MPLL_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSIPLLON);
}

/**
  * @brief  Check if RC64MPLL is Ready
  * @rmtoll CR           HSIPLLRDY        LL_RCC_RC64MPLL_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_RC64MPLL_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSIPLLRDY) == (RCC_CR_HSIPLLRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Set RC64MPLL prescaler
  * @rmtoll CFGR       CLKSYSDIV          LL_RCC_SetRC64MPLLPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_DIV_4
  *         @arg @ref LL_RCC_RC64MPLL_DIV_8
  *         @arg @ref LL_RCC_RC64MPLL_DIV_16
  *         @arg @ref LL_RCC_RC64MPLL_DIV_32
  *         @arg @ref LL_RCC_RC64MPLL_DIV_64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRC64MPLLPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_CLKSYSDIV, Prescaler);
}

/**
  * @brief  Get RC64MPLL prescaler
  * @rmtoll CFGR         CLKSYSDIV     LL_RCC_GetRC64MPLLPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_DIV_4
  *         @arg @ref LL_RCC_RC64MPLL_DIV_8
  *         @arg @ref LL_RCC_RC64MPLL_DIV_16
  *         @arg @ref LL_RCC_RC64MPLL_DIV_32
  *         @arg @ref LL_RCC_RC64MPLL_DIV_64
  */
__STATIC_INLINE uint32_t LL_RCC_GetRC64MPLLPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_CLKSYSDIV));
}

#if defined(RCC_CFGR_CLKSYSDIV_STATUS)
/**
  * @brief  Get System Clock Prescaler Status
  * @rmtoll CFGR         CLKSYSDIV_STATUS     LL_RCC_GetCLKSYSPrescalerStatus
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_DIV_4
  *         @arg @ref LL_RCC_RC64MPLL_DIV_8
  *         @arg @ref LL_RCC_RC64MPLL_DIV_16
  *         @arg @ref LL_RCC_RC64MPLL_DIV_32
  *         @arg @ref LL_RCC_RC64MPLL_DIV_64
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_1
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_2
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_4
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_8
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_16
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_32
  */
__STATIC_INLINE uint32_t LL_RCC_GetCLKSYSPrescalerStatus(void)
{
  return (uint32_t)((READ_BIT(RCC->CFGR, RCC_CFGR_CLKSYSDIV_STATUS) >> RCC_CFGR_CLKSYSDIV_STATUS_Pos) << RCC_CFGR_CLKSYSDIV_Pos);
}
#endif

/**
  * @brief  Set DIRECT_HSE prescaler
  * @rmtoll CFGR       CLKSYSDIV          LL_RCC_SetDirectHSEPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_1
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_2
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_4
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_8
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_16
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_32
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDirectHSEPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_CLKSYSDIV, Prescaler);
}

/**
  * @brief  Get DIRECT_HSE prescaler
  * @rmtoll CFGR         CLKSYSDIV     LL_RCC_GetDirectHSEPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_1
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_2
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_4
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_8
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_16
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_32
  */
__STATIC_INLINE uint32_t LL_RCC_GetDirectHSEPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_CLKSYSDIV));
}
/**
  * @}
  */

/** @defgroup RCC_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Clear LSI ready interrupt flag
  * @rmtoll CIFR         LSIRDYF       LL_RCC_ClearFlag_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSIRDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LSIRDYF);
}

/**
  * @brief  Clear LSE ready interrupt flag
  * @rmtoll CIFR         LSERDYF       LL_RCC_ClearFlag_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSERDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LSERDYF);
}

/**
  * @brief  Clear HSI ready interrupt flag
  * @rmtoll CIFR         HSIRDYF       LL_RCC_ClearFlag_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSIRDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSIRDYF);
}

/**
  * @brief  Clear HSE ready interrupt flag
  * @rmtoll CIFR         HSERDYF       LL_RCC_ClearFlag_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSERDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSERDYF);
}

/**
  * @brief  Clear RC64MPLL ready interrupt flag
  * @rmtoll CIFR         HSIPLLRDYF       LL_RCC_ClearFlag_RC64MPLLRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_RC64MPLLRDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSIPLLRDYF);
}

/**
  * @brief  Clear RC64MPLL Unlock Detection interrupt flag
  * @rmtoll CIFR         HSIPLLUNLOCKDETF       LL_RCC_ClearFlag_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_RC64MPLLUNLOCKDET(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSIPLLUNLOCKDETF);
}

/**
  * @brief  Clear RTC Reset Release interrupt flag
  * @rmtoll CIFR         RTCRSTF       LL_RCC_ClearFlag_RTCRRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_RTCRSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_RTCRSTF);
}

/**
  * @brief  Clear Watchdog Reset Release interrupt flag
  * @rmtoll CIFR         WDGRSTF       LL_RCC_ClearFlag_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_WDGRSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_WDGRSTF);
}

#if defined(RCC_CIFR_LPURSTF)
/**
  * @brief  Clear LPUART Reset Release interrupt flag
  * @rmtoll CIFR         LPURSTF       LL_RCC_ClearFlag_LPURSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LPURSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LPURSTF);
}
#endif

/**
  * @brief  Check if LSI ready interrupt occurred or not
  * @rmtoll CIFR         LSIRDYF       LL_RCC_IsActiveFlag_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSIRDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LSIRDYF) == (RCC_CIFR_LSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE ready interrupt occurred or not
  * @rmtoll CIFR         LSERDYF       LL_RCC_IsActiveFlag_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSERDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LSERDYF) == (RCC_CIFR_LSERDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSI ready interrupt occurred or not
  * @rmtoll CIFR         HSIRDYF       LL_RCC_IsActiveFlag_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSIRDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSIRDYF) == (RCC_CIFR_HSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSE ready interrupt occurred or not
  * @rmtoll CIFR         HSERDYF       LL_RCC_IsActiveFlag_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSERDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSERDYF) == (RCC_CIFR_HSERDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RC64MPLL ready interrupt occurred or not
  * @rmtoll CIFR         HSIPLLRDYF       LL_RCC_IsActiveFlag_RC64MPLLRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RC64MPLLRDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSIPLLRDYF) == (RCC_CIFR_HSIPLLRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RC64MPLL Unlock Detection flag interrupt occurred or not
  * @rmtoll CIFR         HSIPLLUNLOCKDETF       LL_RCC_IsActiveFlag_RC64MPLLUNLOCKDET
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RC64MPLLUNLOCKDET(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSIPLLUNLOCKDETF) == (RCC_CIFR_HSIPLLUNLOCKDETF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RTC Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         RTCRSTF       LL_RCC_IsActiveFlag_RTCRSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RTCRSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_RTCRSTF) == (RCC_CIFR_RTCRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if WDG Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         WDGRSTF       LL_RCC_IsActiveFlag_WDGRSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WDGRSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_WDGRSTF) == (RCC_CIFR_WDGRSTF)) ? 1UL : 0UL);
}

#if defined(RCC_CIFR_LPURSTF)
/**
  * @brief  Check if LPUART Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         LPURSTF       LL_RCC_IsActiveFlag_LPURSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LPURSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LPURSTF) == (RCC_CIFR_LPURSTF)) ? 1UL : 0UL);
}
#endif


/**
  * @brief  Check if RCC flag CPU lockup reset is set or not.
  * @rmtoll CSR          LOCKUPRSTF      LL_RCC_IsActiveFlag_LOCKUPRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LOCKUPRST(void)
{
  return (((RAM_VR.ResetReason & LL_RCC_CSR_LOCKUPRSTF) == LL_RCC_CSR_LOCKUPRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Watchdog reset is set or not.
  * @rmtoll CSR          WDGRSTF      LL_RCC_IsActiveFlag_WDGRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WDGRST(void)
{
  return (((RAM_VR.ResetReason & LL_RCC_CSR_WDGRSTF) == LL_RCC_CSR_WDGRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Software reset is set or not.
  * @rmtoll CSR          SFTRSTF      LL_RCC_IsActiveFlag_SFTRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_SFTRST(void)
{
  return (((RAM_VR.ResetReason & LL_RCC_CSR_SFTRSTF) == LL_RCC_CSR_SFTRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Power-On reset is set or not.
  * @rmtoll CSR          PORRSTF      LL_RCC_IsActiveFlag_PORRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PORRST(void)
{
  return (((RAM_VR.ResetReason & LL_RCC_CSR_PORRSTF) == LL_RCC_CSR_PORRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag NRSTn pad reset is set or not.
  * @rmtoll CSR          PADRSTF      LL_RCC_IsActiveFlag_PADRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PADRST(void)
{
  return (((RAM_VR.ResetReason & LL_RCC_CSR_PADRSTF) == LL_RCC_CSR_PADRSTF) ? 1UL : 0UL);
}

/**
  * @brief  Clear all reset flags.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearResetFlags(void)
{
  RAM_VR.ResetReason = 0;
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_CLK_SWITCH_Management Clock Switch Management
  * @{
  */

/**
  * @brief  Set RC64MPLL prescaler to switch the clock when the MR_BLE is enabled
  * @rmtoll CSCMDR       CLKSYSDIV_REQ          LL_RCC_SwitchRC64MPLLPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_DIV_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SwitchRC64MPLLPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CSCMDR, RCC_CSCMDR_CLKSYSDIV_REQ, Prescaler);
}

/**
  * @brief  Request the RC64MPLL prescaler to switch the clock when the MR_BLE is enabled
  * @rmtoll CSCMDR       REQUEST          LL_RCC_RequestSwitchRC64MPLLClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RequestSwitchRC64MPLLClock(void)
{
  SET_BIT(RCC->CSCMDR, RCC_CSCMDR_REQUEST);
}

/**
  * @brief  Get RC64MPLL clock switch status
  * @rmtoll CSCMDR        STATUS      LL_RCC_HSE_GetCapacitorTuning
  * @retval The Clock switch status. Possible values are:
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_STATUS_IDLE
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_STATUS_ONGOING
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_STATUS_DONE
  */
__STATIC_INLINE uint32_t LL_RCC_GetRC64MPLLSwitchStatus(void)
{
  return (uint32_t)(READ_BIT(RCC->CSCMDR, RCC_CSCMDR_STATUS));
}

/**
  * @brief  Enable End of Switch Sequence interrupt
  * @rmtoll CSCMDR         EOFSEQ_IE      LL_RCC_EnableIT_EOFSEQ
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_EOFSEQ(void)
{
  SET_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IE);
}

/**
  * @brief  Disable End of Switch Sequence interrupt
  * @rmtoll CSCMDR         EOFSEQ_IE      LL_RCC_DisableIT_EOFSEQ
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_EOFSEQ(void)
{
  CLEAR_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IE);
}

/**
  * @brief  Checks if End of Switch Sequence interrupt source is enabled or disabled.
  * @rmtoll CSCMDR         EOFSEQ_IE      LL_RCC_IsEnabledIT_EOFSEQ
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_EOFSEQ(void)
{
  return ((READ_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IE) == (RCC_CSCMDR_EOFSEQ_IE)) ? 1UL : 0UL);
}

/**
  * @brief  Clear End of Sequence interrupt flag
  * @rmtoll CSCMDR         EOFSEQ_IRQ       LL_RCC_ClearFlag_EOFSEQ
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_EOFSEQ(void)
{
  WRITE_REG(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IRQ);
}

/**
  * @brief  Check if End of Sequence interrupt occurred or not
  * @rmtoll CSCMDR         EOFSEQ_IRQ       LL_RCC_IsActiveFlag_EOFSEQ
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_EOFSEQ(void)
{
  return ((READ_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IRQ) == (RCC_CSCMDR_EOFSEQ_IRQ)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup RCC_LL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable LSI ready interrupt
  * @rmtoll CIER         LSIRDYIE      LL_RCC_EnableIT_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSIRDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LSIRDYIE);
}

/**
  * @brief  Enable LSE ready interrupt
  * @rmtoll CIER         LSERDYIE      LL_RCC_EnableIT_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSERDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LSERDYIE);
}

/**
  * @brief  Enable HSI ready interrupt
  * @rmtoll CIER         HSIRDYIE      LL_RCC_EnableIT_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSIRDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSIRDYIE);
}

/**
  * @brief  Enable HSE ready interrupt
  * @rmtoll CIER         HSERDYIE      LL_RCC_EnableIT_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSERDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSERDYIE);
}

/**
  * @brief  Enable RC64MPLL ready interrupt
  * @rmtoll CIER         HSIPLLRDYIE      LL_RCC_EnableIT_RC64MPLLRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_RC64MPLLRDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSIPLLRDYIE);
}

/**
  * @brief  Enable RC64MPLL Unlock Detection interrupt
  * @rmtoll CIER         RCC_CIER_HSIPLLUNLOCKDETIE      LL_RCC_EnableIT_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_RC64MPLLUNLOCKDET(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSIPLLUNLOCKDETIE);
}

/**
  * @brief  Enable RTC Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_RTCRSTIE      LL_RCC_EnableIT_RTCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_RTCRSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_RTCRSTIE);
}

/**
  * @brief  Enable Watchdog Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_WDGRSTIE      LL_RCC_EnableIT_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_WDGRSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_WDGRSTIE);
}

#if defined(RCC_CIER_LPURSTIE)
/**
  * @brief  Enable LPUART Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LPURSTIE      LL_RCC_EnableIT_LPURSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LPURSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LPURSTIE);
}
#endif

/**
  * @brief  Disable LSI ready interrupt
  * @rmtoll CIER         LSIRDYIE      LL_RCC_DisableIT_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSIRDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LSIRDYIE);
}

/**
  * @brief  Disable LSE ready interrupt
  * @rmtoll CIER         LSERDYIE      LL_RCC_DisableIT_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSERDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LSERDYIE);
}

/**
  * @brief  Disable HSI ready interrupt
  * @rmtoll CIER         HSIRDYIE      LL_RCC_DisableIT_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSIRDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSIRDYIE);
}

/**
  * @brief  Disable HSE ready interrupt
  * @rmtoll CIER         HSERDYIE      LL_RCC_DisableIT_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSERDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSERDYIE);
}

/**
  * @brief  Disable RC64MPLL ready interrupt
  * @rmtoll CIER         HSIPLLRDYIE      LL_RCC_DisableIT_RC64MPLLRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_RC64MPLLRDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSIPLLRDYIE);
}

/**
  * @brief  Disable RC64MPLL Unlock Detection interrupt
  * @rmtoll CIER         RCC_CIER_HSIPLLUNLOCKDETIE      LL_RCC_DisableIT_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_RC64MPLLUNLOCKDET(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSIPLLUNLOCKDETIE);
}

/**
  * @brief  Disable RTC Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_RTCRSTIE      LL_RCC_DisableIT_RTCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_RTCRSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_RTCRSTIE);
}

/**
  * @brief  Disable Watchdog Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_WDGRSTIE      LL_RCC_DisableIT_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_WDGRSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_WDGRSTIE);
}

#if defined(RCC_CIER_LPURSTIE)
/**
  * @brief  Disable LPUART Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LPURSTIE      LL_RCC_DisableIT_LPURSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LPURSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LPURSTIE);
}
#endif

/**
  * @brief  Checks if LSI ready interrupt source is enabled or disabled.
  * @rmtoll CIER         LSIRDYIE      LL_RCC_IsEnabledIT_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSIRDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LSIRDYIE) == (RCC_CIER_LSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if LSE ready interrupt source is enabled or disabled.
  * @rmtoll CIER         LSERDYIE      LL_RCC_IsEnabledIT_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSERDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LSERDYIE) == (RCC_CIER_LSERDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if HSI ready interrupt source is enabled or disabled.
  * @rmtoll CIER         HSIRDYIE      LL_RCC_IsEnabledIT_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSIRDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSIRDYIE) == (RCC_CIER_HSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if HSE ready interrupt source is enabled or disabled.
  * @rmtoll CIER         HSERDYIE      LL_RCC_IsEnabledIT_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSERDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSERDYIE) == (RCC_CIER_HSERDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if RC64MPLL ready interrupt source is enabled or disabled.
  * @rmtoll CIER         HSIPLLRDYIE      LL_RCC_IsEnabledIT_RC64MPLLRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_RC64MPLLRDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSIPLLRDYIE) == (RCC_CIER_HSIPLLRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if RC64MPLL Unlock Detection interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_HSIPLLUNLOCKDETIE      LL_RCC_IsEnabledIT_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_RC64MPLLUNLOCKDET(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSIPLLUNLOCKDETIE) == (RCC_CIER_HSIPLLUNLOCKDETIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if RTC Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_RTCRSTIE      LL_RCC_IsEnabledIT_RTCRSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_RTCRSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_RTCRSTIE) == (RCC_CIER_RTCRSTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if Watchdog Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_WDGRSTIE      LL_RCC_IsEnabledIT_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_WDGRSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_WDGRSTIE) == (RCC_CIER_WDGRSTIE)) ? 1UL : 0UL);
}

#if defined(RCC_CIER_LPURSTIE)
/**
  * @brief  Checks if LPUART Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_LPURSTIE      LL_RCC_IsEnabledIT_LPURSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LPURSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LPURSTIE) == (RCC_CIER_LPURSTIE)) ? 1UL : 0UL);
}
#endif


/**
  * @}
  */

/** @defgroup RCC_LL_HSEPLL_BUFFER_RF External high speed clock buffer for PLL RF2G4
  * @{
  */

/**
  * @brief  Enable high speed clock buffer for PLL RF2G4
  * @rmtoll CR           HSEPLLBUFON     LL_RCC_HSEPLLBUFON_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEPLLBUFON_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSEPLLBUFON);
}

/**
  * @brief  Disable high speed clock buffer for PLL RF2G4
  * @rmtoll CR           HSEPLLBUFON         LL_RCC_HSEPLLBUFON_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEPLLBUFON_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSEPLLBUFON);
}

/**
  * @brief  Check if the high speed clock buffer for PLL RF2G4 is enabled.
  * @rmtoll CR         HSEPLLBUFON        LL_RCC_HSEPLLBUFON_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSEPLLBUFON_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSEPLLBUFON) == (RCC_CR_HSEPLLBUFON)) ? 1UL : 0UL);
}
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EF_Init De-initialization function
  * @{
  */
ErrorStatus LL_RCC_DeInit(void);
/**
  * @}
  */

/** @defgroup RCC_LL_EF_Get_Freq Get system and peripherals clocks frequency functions
  * @{
  */
void        LL_RCC_GetSystemClocksFreq(LL_RCC_ClocksTypeDef *RCC_Clocks);
uint32_t    LL_RCC_GetSMPSClockFreq(void);
#if defined(RCC_CFGR_LPUCLKSEL)
uint32_t    LL_RCC_GetLPUARTClockFreq(uint32_t LPUARTxSource);
#endif /* RCC_CFGR_LPUCLKSEL */

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32WB0x_LL_RCC_H */
